#+OPTIONS: todo:t tags:nil tasks:t ^:nil toc:nil
#+TODO: OPEN(y) (e) PROG(g) INTR(q) NEXT(n) | ABRT(a) DONE(f) CLSD(c)
#+FILETAGS: :PACKAGES:typDev:catEnhancement:
* OPEN Remote Workspace :subWorkflow@Remote:
:PROPERTIES:
:ID: f2003a39-72eb-40b7-a832-b209c8cf9cff
:END:

#+name: Description
#+begin_quote org
Emulate the same environment as current remote machine on work station to deal with remote jobs such as =opencode= running commands
#+end_quote

/Checkout:/ [[id:58910689-be05-4304-8b9b-7d2c03fee002][Managing Dotfiles with Chezmoi]]
* OPEN Configure WireGuard VPN :subWireGuard:
:PROPERTIES:
:ID: c9c7fb4d-e56d-45ae-8c56-2e402cc1d623
:END:

#+name: Description
#+begin_quote org
Configure =wireguard= vpn for home network and bypassing NAT blocking in public network. Also enhance security
#+end_quote
* OPEN Plaintext Mail Management :subMail@Workflow:
:PROPERTIES:
:ID: 1fcbea49-43b6-4376-90be-50c0209b0b79
:END:

#+name: Description
#+begin_quote org
How to effective work with plaintext email. Note down the whole workflow
#+end_quote

/Docs:/  [[id:987b841e-623e-4b40-9387-c3870883d966][Plaintext email workflow @Doc]]
* OPEN Testing Otter for Orgmode :subNvim@LSP:subOrgmode:
:PROPERTIES:
:ID: 09dcfee0-718f-449c-b448-e3aef672ac1e
:END:

#+begin_quote org
Testing nvim-orgmode with =otter= to run LSP server on embed code in inside a codeblock
#+end_quote

#+name: import
#+begin_src python :tangle no :noweb yes
import numpy as np
import pylab as plt
#+end_src

#+RESULTS: import
: None

#+name: Example
#+begin_src python :tangle no :noweb yes :results output
<<import>>

x = np.linspace(-10, 10, num=101)
y = x**2
print(f"Plot saved to parabola.png ({x[0]:.0f} to {x[-1]:.0f})")
plt.plot(x, y)
plt.show()
# plt.savefig("parabola.png")
#+end_src

#+RESULTS: Example
: Plot saved to parabola.png (-10 to 10)

#+name: print
#+begin_src python :tangle ~/hi.py :noweb yes :results output
print("Hello World")
#+end_src

#+RESULTS: print
: Hello World

** OPEN Adding org-babel Execution
:PROPERTIES:
:ID: e868f529-fd09-440c-af87-0432b8225045
:END:
